import datetime

from app.enums.equipment import 市场风格

test_timing_backtest_indicator = {
    "标识符": "03000000test01",
    "开始时间": datetime.datetime(2018, 1, 1),
    "结束时间": datetime.datetime(2019, 1, 1),
    "回测年份": "2017",
    "交易总天数": 245,
    "获胜天数": 192,
    "胜率": 0.7837,
    "收益率": 0.4351,
    "超额收益率": -0.0815,
    "标的指数": "000300",
    "标的指数收益率": 0.5166,
}

test_screen_backtest_indicator = {
    "交易日期": datetime.datetime(2019, 1, 1),
    "标识符": "02000000test01",
    "结束时间": datetime.datetime(2019, 1, 1),
    "Alpha": 0.148,
    "Beta": 1.0738,
    "信息比率": 0.7238,
    "剧烈上涨环境胜率": 0.6698,
    "剧烈下跌环境胜率": 0.4613,
    "名称": "巴菲特选股",
    "基准收益率": 0.2877,
    "夏普比率": 0.4884,
    "宽幅震荡环境胜率": 0.607,
    "平缓上涨环境胜率": 0.4906,
    "平缓下跌环境胜率": 0.5143,
    "年化收益率": 0.185,
    "开始时间": datetime.datetime(2018, 1, 1),
    "收益率": 1.2897,
    "累计收益率": 2.323,
    "最佳调仓周期": "10",
    "最大单日涨幅": 0.0992,
    "最大单日跌幅": -0.0979,
    "最大回撤": 0.4087,
    "波动率": 0.304,
    "窄幅震荡环境胜率": 0.5554,
    "胜率": 0.1,
    "适用市场": 市场风格.剧烈上涨,
    "平均每日选股数": 4,
    "总交易日数量": 100,
    "总信号数量": 300
}

test_timing_backtest_signal = {
    "交易日期": datetime.datetime(2018, 1, 1),
    "账户资产": 1.3331,
    "收益率": -0.0215,
    "累计收益率": 1.3557,
    "标的指数": "000300",
    "标识符": "03000000test01",
}

test_screen_backtest_signal = {
    "交易日期": datetime.datetime(2019, 1, 1),
    "账户资产": 1474187.0022,
    "收益率": -0.0058,
    "累计收益率": 1.9496,
    "近一周收益率": -0.0475657716300515,
    "近一月收益率": -0.00898426905343081,
    "标识符": "02000000test01",
}

test_timing_backtest_assess = {
    "标识符": "03000000test01",
    "开始时间": datetime.datetime(2018, 1, 1),
    "结束时间": datetime.datetime(2019, 1, 1),
    "回测年份": "2014",
    "收益率得分": -0.0276,
    "胜率得分": 5,
    "胜率和收益率得分": 8.4,
    "评级": "B",
    "总得分": 7.6,
    "标的指数": "000300",
    "最大回撤得分": 0,
    "收益风险比得分": 0,
}

test_screen_backtest_assess = [
    {
        "评级": "A",
        "总得分": 8.6984,
        "年化收益率得分": 13.5,
        "最大回撤得分": 10,
        "胜率得分": 10,
        "夏普比率得分": 10,
        "年化收益率总得分": 12.8571,
        "最大回撤总得分": 8.2857,
        "胜率总得分": 9.1429,
        "夏普比率总得分": 8.8571,
        "调仓周期": 3,
        "开始时间": datetime.datetime(2018, 1, 1),
        "结束时间": datetime.datetime(2019, 1, 1),
        "标识符": "02000000test01",
        "数据集": "整体评级",
    },
    {
        "评级": "B",
        "总得分": 8.6984,
        "年化收益率得分": 13.5,
        "最大回撤得分": 10,
        "胜率得分": 10,
        "夏普比率得分": 10,
        "年化收益率总得分": 12.8571,
        "最大回撤总得分": 8.2857,
        "胜率总得分": 9.1429,
        "夏普比率总得分": 8.8571,
        "调仓周期": 3,
        "开始时间": datetime.datetime(2018, 1, 1),
        "结束时间": datetime.datetime(2019, 5, 1),
        "标识符": "02000000test02",
        "数据集": "测试集评级",
    },
]

test_timing_real_signal = {
    "交易日期": datetime.datetime(2018, 1, 1),
    "账户资产": 1.0035,
    "收益率": 0.0035,
    "累计收益率": 0.0035,
    "标的指数": "399006",
    "近一周收益率": 0.0035,
    "近一月收益率": 0.0035,
    "标识符": "03000000test01",
}

test_screen_real_signal = {
    "交易日期": datetime.datetime(2019, 1, 1),
    "账户资产": 617613.672325,
    "收益率": -0.0181,
    "累计收益率": 0.2354,
    "近一周收益率": -0.00752792617775608,
    "近一月收益率": -0.0184555609519183,
    "标识符": "02000000test01",
    "hold_schedule": "20190718",
}


test_大类资产实盘信号_real_signal = {
    "标识符": "06000000test10",
    "交易日期": datetime.datetime(2019, 1, 1),
    "个股买入均价": 1.5804740000000002,
    "个股交易成本": 16.447799999999997,
    "个股仓位占比": 0.10957397039230388,
    "个股卖出均价": 0.0,
    "个股持仓变动": 34700.0,
    "个股持仓天数": 1.0,
    "个股持仓市值": 54374.9,
    "个股持仓成本": 1.5804740000000002,
    "个股持仓数量": 34700.0,
    "个股收益率": -0.008525290514111725,
    "个股盈亏额": -467.54780000000756,
    "个股累计交易成本": 16.447799999999997,
    "个股资金变动": -54842.44780000001,
    "买卖方向": "买入",
    "交易市场": "CNSESZ",
    "收盘价": 1.567,
    "证券代码": "159920",
    "证券名称": "华夏恒生ETF(QDII)",
}
