from datetime import datetime

backtest_indicator_timings_columns = [
    {"正式名称": "sid", "别名": ["标识符"], "类型": str, "描述": ""},
    {"正式名称": "开始时间", "别名": ["start_time"], "类型": datetime, "描述": ""},
    {"正式名称": "结束时间", "别名": ["end_time"], "类型": datetime, "描述": ""},
    {"正式名称": "回测年份", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "交易总天数", "别名": [], "类型": int, "描述": ""},
    {"正式名称": "获胜天数", "别名": [], "类型": int, "描述": ""},
    {"正式名称": "胜率", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "收益率", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "超额收益率", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "标的指数", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "标的指数收益率", "别名": [], "类型": float, "描述": ""},
]
