from datetime import datetime


backtest_assess_timings_columns = [
    {"正式名称": "sid", "别名": ["标识符"], "类型": str, "描述": ""},
    {"正式名称": "开始时间", "别名": ["start_time"], "类型": datetime, "描述": ""},
    {"正式名称": "结束时间", "别名": ["end_time"], "类型": datetime, "描述": ""},
    {"正式名称": "回测年份", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "收益率得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "胜率得分", "别名": ["rating"], "类型": float, "描述": ""},
    {"正式名称": "胜率和收益率得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "评级", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "总得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "标的指数", "别名": [], "类型": str, "描述": ""},
]
