from datetime import datetime

from app.enums.common import 回测评级数据集

backtest_assess_screens_columns = [
    {"正式名称": "sid", "别名": ["标识符"], "类型": str, "描述": ""},
    {"正式名称": "开始时间", "别名": ["start_time"], "类型": datetime, "描述": ""},
    {"正式名称": "结束时间", "别名": ["end_time"], "类型": datetime, "描述": ""},
    {"正式名称": "数据集", "别名": [], "类型": 回测评级数据集, "描述": ""},
    {"正式名称": "胜率得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "评级", "别名": ["rating"], "类型": str, "描述": ""},
    {"正式名称": "总得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "年化收益率得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "最大回撤得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "夏普比率得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "胜率总得分", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "调仓周期", "别名": [], "类型": int, "描述": ""},
]
