from datetime import datetime

from app.enums.common import 操作方向

real_signal_robot_columns = [
    {"正式名称": "sid", "别名": ["标识符"], "类型": str, "描述": ""},
    {"正式名称": "交易日期", "别名": ["trade_date"], "类型": datetime, "描述": ""},
    {"正式名称": "证券代码", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "交易市场", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "行业分类", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "证券名称", "别名": [], "类型": str, "描述": ""},
    {"正式名称": "收盘价", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "买卖方向", "别名": [], "类型": 操作方向, "描述": ""},
    {"正式名称": "个股持仓市值", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股持仓数量", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股卖出均价", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股买入均价", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股持仓变动", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股收益率", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股盈亏额", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股资金变动", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股持仓成本", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股仓位占比", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股持仓天数", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股累计交易成本", "别名": [], "类型": float, "描述": ""},
    {"正式名称": "个股交易成本", "别名": [], "类型": float, "描述": ""},
]
