from app.models.base.equipment import (
    专属配置,
    装备运行数据,
    装备基本信息,
    选股装备回测指标基本信息,
    选股装备回测信号基本信息,
    选股装备实盘信号基本信息,
    选股装备实盘指标基本信息,
    择时装备回测信号基本信息,
    择时装备回测指标基本信息,
    择时装备回测评级基本信息,
    择时装备实盘信号基本信息,
    择时装备实盘指标基本信息,
    大类资产配置回测信号基本信息,
    大类资产配置回测指标基本信息,
    大类资产配置回测评级基本信息,
    大类资产配置实盘信号基本信息,
    大类资产配置实盘指标基本信息,
    基金定投回测信号基本信息,
    基金定投回测指标基本信息,
    基金定投回测评级基本信息,
    基金定投实盘信号基本信息,
    基金定投实盘指标基本信息,
    选股装备回测评级基本信息,
)


class Equipment(专属配置, 装备运行数据, 装备基本信息):
    """装备表"""


########################################################################################################################
# 择时装备
########################################################################################################################
class 择时装备回测信号(择时装备回测信号基本信息):
    ...


class 择时装备回测指标(择时装备回测指标基本信息):
    ...


class 择时装备回测评级(择时装备回测评级基本信息):
    ...


class 择时装备实盘信号(择时装备实盘信号基本信息):
    ...


class 择时装备实盘指标(择时装备实盘指标基本信息):
    ...


########################################################################################################################
# 选股装备
########################################################################################################################
class 选股装备回测信号(选股装备回测信号基本信息):
    ...


class 选股装备回测指标(选股装备回测指标基本信息):
    ...


class 选股装备回测评级(选股装备回测评级基本信息):
    ...


class 选股装备实盘信号(选股装备实盘信号基本信息):
    ...


class 选股装备实盘指标(选股装备实盘指标基本信息):
    ...


########################################################################################################################
# 大类资产配置
########################################################################################################################
class 大类资产配置回测信号(大类资产配置回测信号基本信息):
    ...


class 大类资产配置回测指标(大类资产配置回测指标基本信息):
    ...


class 大类资产配置回测评级(大类资产配置回测评级基本信息):
    ...


class 大类资产配置实盘信号(大类资产配置实盘信号基本信息):
    ...


class 大类资产配置实盘指标(大类资产配置实盘指标基本信息):
    ...


########################################################################################################################
# 基金定投
########################################################################################################################
class 基金定投回测信号(基金定投回测信号基本信息):
    ...


class 基金定投回测指标(基金定投回测指标基本信息):
    ...


class 基金定投回测评级(基金定投回测评级基本信息):
    ...


class 基金定投实盘信号(基金定投实盘信号基本信息):
    ...


class 基金定投实盘指标(基金定投实盘指标基本信息):
    ...
