from app.models.base.strategy_data import (
    择时回测信号基本信息,
    择时回测指标基本信息,
    择时回测评级基本信息,
    择时实盘信号基本信息,
    择时实盘指标基本信息,
    选股回测信号基本信息,
    选股回测指标基本信息,
    选股回测评级基本信息,
    选股实盘信号基本信息,
    选股实盘指标基本信息,
    大类资产配置回测信号基本信息,
    大类资产配置回测指标基本信息,
    大类资产配置回测评级基本信息,
    大类资产配置实盘信号基本信息,
    大类资产配置实盘指标基本信息,
    基金定投回测信号基本信息,
    基金定投回测指标基本信息,
    基金定投回测评级基本信息,
    基金定投实盘信号基本信息,
    基金定投实盘指标基本信息,
    机器人回测指标基本信息,
    机器人回测信号基本信息,
    机器人回测评级基本信息,
    机器人实盘信号基本信息,
    机器人实盘指标基本信息,
)


########################################################################################################################################
# 择时装备
########################################################################################################################################


class 择时回测信号(择时回测信号基本信息):
    ...


class 择时回测指标(择时回测指标基本信息):
    ...


class 择时回测评级(择时回测评级基本信息):
    ...


class 择时实盘信号(择时实盘信号基本信息):
    ...


class 择时实盘指标(择时实盘指标基本信息):
    ...


########################################################################################################################################
# 选股装备
########################################################################################################################################
class 选股回测信号(选股回测信号基本信息):
    ...


class 选股回测指标(选股回测指标基本信息):
    ...


class 选股回测评级(选股回测评级基本信息):
    ...


class 选股实盘信号(选股实盘信号基本信息):
    ...


class 选股实盘指标(选股实盘指标基本信息):
    ...


########################################################################################################################################
# 大类资产配置
########################################################################################################################################
class 大类资产配置回测信号(大类资产配置回测信号基本信息):
    ...


class 大类资产配置回测指标(大类资产配置回测指标基本信息):
    ...


class 大类资产配置回测评级(大类资产配置回测评级基本信息):
    ...


class 大类资产配置实盘信号(大类资产配置实盘信号基本信息):
    ...


class 大类资产配置实盘指标(大类资产配置实盘指标基本信息):
    ...


########################################################################################################################################
# 基金定投
########################################################################################################################################
class 基金定投回测信号(基金定投回测信号基本信息):
    ...


class 基金定投回测指标(基金定投回测指标基本信息):
    ...


class 基金定投回测评级(基金定投回测评级基本信息):
    ...


class 基金定投实盘信号(基金定投实盘信号基本信息):
    ...


class 基金定投实盘指标(基金定投实盘指标基本信息):
    ...


########################################################################################################################################
# 机器人
########################################################################################################################################


class 机器人回测指标(机器人回测指标基本信息):
    ...


class 机器人回测信号(机器人回测信号基本信息):
    ...


class 机器人回测评级(机器人回测评级基本信息):
    ...


class 机器人实盘信号(机器人实盘信号基本信息):
    ...


class 机器人实盘指标(机器人实盘指标基本信息):
    ...
